[Killed] BlockStatement
src/car.js:2:60
 class Carro {
-    constructor(id, modelo, marca, ano, disponivel = true) {
-        this.id = id;
-        this.modelo = modelo;
-        this.marca = marca;
-        this.ano = ano;
-        this.disponivel = disponivel;
-    }
+    constructor(id, modelo, marca, ano, disponivel = true) {}
 
     alugar() {
killedBy: RentalSystem deve remover um carro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] BooleanLiteral
src/car.js:2:54
 class Carro {
-    constructor(id, modelo, marca, ano, disponivel = true) {
+    constructor(id, modelo, marca, ano, disponivel = false) {
         this.id = id;
         this.modelo = modelo;
killedBy: RentalSystem deve listar todos os carros
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   Object {
+   Carro {

[Killed] BlockStatement
src/car.js:10:14
         this.disponivel = disponivel;
     }
 
-    alugar() {
-        if (!this.disponivel) {
-            throw new Error("Carro já está alugado.");
-        }
-        this.disponivel = false;
-    }
+    alugar() {}
 
     devolver() {
killedBy: RentalSystem deve alugar um carro disponível
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/car.js:11:31
     }
 
     alugar() {
-        if (!this.disponivel) {
-            throw new Error("Carro já está alugado.");
-        }
+        if (!this.disponivel) {}
         this.disponivel = false;
     }
killedBy: Carro não deve alugar um carro já alugado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Carro já está alugado."

Received function did not throw

[Killed] ConditionalExpression
src/car.js:11:13
     }
 
     alugar() {
-        if (!this.disponivel) {
+        if (false) {
             throw new Error("Carro já está alugado.");
         }
killedBy: Carro não deve alugar um carro já alugado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Carro já está alugado."

Received function did not throw

[Killed] BooleanLiteral
src/car.js:14:27
         if (!this.disponivel) {
             throw new Error("Carro já está alugado.");
         }
-        this.disponivel = false;
+        this.disponivel = true;
     }
 
killedBy: RentalSystem deve alugar um carro disponível
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/car.js:17:16
         this.disponivel = false;
     }
 
-    devolver() {
-        if (this.disponivel) {
-            throw new Error("Carro está disponível.");
-        }
-        this.disponivel = true;
-    }
+    devolver() {}
 }
 
killedBy: Carro deve devolver um carro alugado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/car.js:18:13
     }
 
     devolver() {
-        if (this.disponivel) {
+        if (true) {
             throw new Error("Carro está disponível.");
         }
killedBy: Carro deve devolver um carro alugado
statusReason: Error: Carro está disponível.

[Killed] ConditionalExpression
src/car.js:18:13
     }
 
     devolver() {
-        if (this.disponivel) {
+        if (false) {
             throw new Error("Carro está disponível.");
         }
killedBy: Carro não deve devolver um carro já disponível
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Carro está disponível."

Received function did not throw

[Killed] BooleanLiteral
src/car.js:21:27
         if (this.disponivel) {
             throw new Error("Carro está disponível.");
         }
-        this.disponivel = true;
+        this.disponivel = false;
     }
 }
killedBy: Carro deve devolver um carro alugado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
