[Killed] BlockStatement
src/rental.js:2:19
 class RentalSystem {
-    constructor() {
-        this.carros = [];
-    }
+    constructor() {}
 
     adicionarCarro(carro) {
killedBy: RentalSystem deve adicionar um carro
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ArrayDeclaration
src/rental.js:3:23
 class RentalSystem {
     constructor() {
-        this.carros = [];
+        this.carros = ["Stryker was here"];
     }
 
killedBy: RentalSystem deve adicionar um carro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Killed] BlockStatement
src/rental.js:6:27
         this.carros = [];
     }
 
-    adicionarCarro(carro) {
-        this.carros.push(carro);
-    }
+    adicionarCarro(carro) {}
 
     removerCarro(id) {
killedBy: RentalSystem deve adicionar um carro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] BlockStatement
src/rental.js:10:22
         this.carros.push(carro);
     }
 
-    removerCarro(id) {
-        this.carros = this.carros.filter(carro => carro.id !== id);
-    }
+    removerCarro(id) {}
 
     listarCarros() {
killedBy: RentalSystem deve remover um carro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] MethodExpression
src/rental.js:11:23
     }
 
     removerCarro(id) {
-        this.carros = this.carros.filter(carro => carro.id !== id);
+        this.carros = this.carros;
     }
 
killedBy: RentalSystem deve remover um carro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ArrowFunction
src/rental.js:11:42
     }
 
     removerCarro(id) {
-        this.carros = this.carros.filter(carro => carro.id !== id);
+        this.carros = this.carros.filter(() => undefined);
     }
 
killedBy: RentalSystem deve remover um carro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/rental.js:14:20
         this.carros = this.carros.filter(carro => carro.id !== id);
     }
 
-    listarCarros() {
-        return this.carros;
-    }
+    listarCarros() {}
 
     alugarCarro(id) {
killedBy: RentalSystem deve adicionar um carro
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/rental.js:18:21
         return this.carros;
     }
 
-    alugarCarro(id) {
-        const carro = this.carros.find(carro => carro.id === id);
-        if (!carro) {
-            throw new Error(`Carro com ID ${id} não encontrado.`);
-        }
-        carro.alugar();
-    }
+    alugarCarro(id) {}
 
     devolverCarro(id) {
killedBy: RentalSystem deve alugar um carro disponível
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/rental.js:19:49
     }
 
     alugarCarro(id) {
-        const carro = this.carros.find(carro => carro.id === id);
+        const carro = this.carros.find(carro => carro.id !== id);
         if (!carro) {
             throw new Error(`Carro com ID ${id} não encontrado.`);
killedBy: RentalSystem deve alugar um carro disponível
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/rental.js:19:49
     }
 
     alugarCarro(id) {
-        const carro = this.carros.find(carro => carro.id === id);
+        const carro = this.carros.find(carro => true);
         if (!carro) {
             throw new Error(`Carro com ID ${id} não encontrado.`);
killedBy: RentalSystem não deve alugar um carro não encontrado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Carro com ID 3 não encontrado."

Received function did not throw

[Killed] BooleanLiteral
src/rental.js:20:13
 
     alugarCarro(id) {
         const carro = this.carros.find(carro => carro.id === id);
-        if (!carro) {
+        if (carro) {
             throw new Error(`Carro com ID ${id} não encontrado.`);
         }
killedBy: RentalSystem deve alugar um carro disponível
statusReason: Error: Carro com ID 1 não encontrado.

[Killed] ConditionalExpression
src/rental.js:20:13
 
     alugarCarro(id) {
         const carro = this.carros.find(carro => carro.id === id);
-        if (!carro) {
+        if (true) {
             throw new Error(`Carro com ID ${id} não encontrado.`);
         }
killedBy: RentalSystem deve alugar um carro disponível
statusReason: Error: Carro com ID 1 não encontrado.

[Killed] BlockStatement
src/rental.js:26:23
         carro.alugar();
     }
 
-    devolverCarro(id) {
-        const carro = this.carros.find(carro => carro.id === id);
-        if (!carro) {
-            throw new Error(`Carro com ID ${id} não encontrado.`);
-        }
-        carro.devolver();
-    }
+    devolverCarro(id) {}
 }
 
killedBy: RentalSystem deve devolver um carro alugado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/rental.js:27:49
     }
 
     devolverCarro(id) {
-        const carro = this.carros.find(carro => carro.id === id);
+        const carro = this.carros.find(carro => carro.id !== id);
         if (!carro) {
             throw new Error(`Carro com ID ${id} não encontrado.`);
killedBy: RentalSystem deve devolver um carro alugado
statusReason: Error: Carro está disponível.

[Killed] ConditionalExpression
src/rental.js:27:49
     }
 
     devolverCarro(id) {
-        const carro = this.carros.find(carro => carro.id === id);
+        const carro = this.carros.find(carro => true);
         if (!carro) {
             throw new Error(`Carro com ID ${id} não encontrado.`);
killedBy: RentalSystem não deve devolver um carro não encontrado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Carro com ID 3 não encontrado."
Received message:   "Carro está disponível."

      85 |         } else {
      86 |           stryCov_9fa48("12");
    > 87 |           throw new Error(stryMutAct_9fa48("13") ? "" : (stryCov_9fa48("13"), "Carro está disponível."));

[Killed] BlockStatement
src/rental.js:28:21
 
     devolverCarro(id) {
         const carro = this.carros.find(carro => carro.id === id);
-        if (!carro) {
-            throw new Error(`Carro com ID ${id} não encontrado.`);
-        }
+        if (!carro) {}
         carro.devolver();
     }
killedBy: RentalSystem não deve devolver um carro não encontrado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Carro com ID 3 não encontrado."
Received message:   "Cannot read properties of undefined (reading 'devolver')"

      110 |         }
      111 |       }
    > 112 |       carro.devolver();

[Killed] ConditionalExpression
src/rental.js:28:13
 
     devolverCarro(id) {
         const carro = this.carros.find(carro => carro.id === id);
-        if (!carro) {
+        if (false) {
             throw new Error(`Carro com ID ${id} não encontrado.`);
         }
killedBy: RentalSystem não deve devolver um carro não encontrado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Carro com ID 3 não encontrado."
Received message:   "Cannot read properties of undefined (reading 'devolver')"

      110 |         }
      111 |       }
    > 112 |       carro.devolver();

[Killed] StringLiteral
src/rental.js:29:29
     devolverCarro(id) {
         const carro = this.carros.find(carro => carro.id === id);
         if (!carro) {
-            throw new Error(`Carro com ID ${id} não encontrado.`);
+            throw new Error(``);
         }
         carro.devolver();
killedBy: RentalSystem não deve devolver um carro não encontrado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Carro com ID 3 não encontrado."
Received message:   ""

      107 |         } else {
      108 |           stryCov_9fa48("43");
    > 109 |           throw new Error(stryMutAct_9fa48("44") ? `` : (stryCov_9fa48("44"), `Carro com ID ${id} não encontrado.`));
